Not using MS Graph as far as I know - we've been using v1.0.0 of the provider, and I've only just tested it with v1.6.0.

Here's config and logs for service principal not being considered an owner:

```
terraform {
  required_version = "= 0.14.5"
  required_providers {
    azuread = {
      source = "hashicorp/azuread"
      version = "1.6.0"
    }
  }
}

provider "azuread" {
  client_id       = "***"
  tenant_id       = "***"
  client_secret = "***"
}

data "azuread_client_config" "current" {}

data "azuread_user" "user" {
  user_principal_name = "patrick.marabeas@***.com"
}

resource "azuread_group" "test_group" {
  name = "test_group"
  owners = [
    data.azuread_client_config.current.object_id,
    data.azuread_user.user.object_id,
  ]
}
```

Log:

```
Terraform will perform the following actions:

  # azuread_group.group will be created
  + resource "azuread_group" "group" {
      + display_name            = (known after apply)
      + id                      = (known after apply)
      + mail_enabled            = (known after apply)
      + members                 = (known after apply)
      + name                    = "test_group"
      + object_id               = (known after apply)
      + owners                  = [
          + "***",
          + "***",
        ]
      + prevent_duplicate_names = false
      + security_enabled        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

. . . 

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Update group owners to remove myself:

```
resource "azuread_group" "test_group" {
  name = "test_group"
  owners = [
    data.azuread_client_config.current.object_id,
  ]
}
```

Log:

```
Terraform will perform the following actions:

  # azuread_group.group will be updated in-place
  ~ resource "azuread_group" "group" {
        id                      = "***"
        name                    = "test_group"
      ~ owners                  = [
          - "***",
            # (1 unchanged element hidden)
        ]
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Error: Removing group owner "***" from group with object ID: "***"

  on test.tf line 42, in resource "azuread_group" "group":
  42: resource "azuread_group" "group" {

graphrbac.GroupsClient#RemoveOwner: Failure responding to request:
StatusCode=400 -- Original Error: autorest/azure: Service returned an error.
Status=400 Code="Unknown" Message="Unknown service error"
Details=[{"odata.error":{"code":"Request_BadRequest","date":"2021-06-25T03:35:26","message":{"lang":"en","value":"The
group must have at least one owner, hence this owner cannot be
removed."},"requestId":"***"}}]
```

Similarly if an additional owner is added, while removing a user (service principal still as owner):

```
data "azuread_user" "user2" {
  user_principal_name = "***@***.com"
}

resource "azuread_group" "group" {
  name = "test_group"
  owners = [
    data.azuread_client_config.current.object_id,
    data.azuread_user.user2.object_id,
  ]
}
```

Log:

```
Terraform will perform the following actions:

  # azuread_group.group will be updated in-place
  ~ resource "azuread_group" "group" {
        id                      = "***"
        name                    = "test_group"
      ~ owners                  = [
          - "***",
          + "***",
            # (1 unchanged element hidden)
        ]
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Error: Removing group owner "***" from group with object ID: "***"

  on test.tf line 46, in resource "azuread_group" "group":
  46: resource "azuread_group" "group" {

graphrbac.GroupsClient#RemoveOwner: Failure responding to request:
StatusCode=400 -- Original Error: autorest/azure: Service returned an error.
Status=400 Code="Unknown" Message="Unknown service error"
Details=[{"odata.error":{"code":"Request_BadRequest","date":"2021-06-25T03:43:20","message":{"lang":"en","value":"The
group must have at least one owner, hence this owner cannot be
removed."},"requestId":"***"}}]
```
